app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY chore_date DESC LIMIT 1
---
  def index
    @users = User.all

INSERT INTO `users` (`admin`, `chore_date`, `created_at`, `crypted_password`, `email`, `password_salt`, `persistence_token`, `updated_at`, `username`) VALUES (NULL, '2012-10-01 21:10:03', '2012-10-02 21:10:03', '02641aa196ddaa623ef60d0fc4f40b512a2f40b5d75fa0fade0e5147111e748c7d1338b84365c0998c9ed0d8ca51fe9e2fb248baa1bb2ee8beec93751dedcee8', 'bill@bob.com', 'O32r7oB0DTBEt63a4po', '3a319902dc766ae3eda786a322c50a51515bdcc439ee24abd3e901455aaad45ef04825de02a850644a4c82018b041ed487aafaa5b3bb04f1d29e9f773ee7330b', '2012-10-02 21:10:03', 'Bill Bob')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
UPDATE `users` SET `password_salt` = 'nE9vdwiDeWFFvGKwY1j', `crypted_password` = '983a1685adfbc993780e012a1de34af66cc01c7c344dcaf4ba84b5ea1ac49661d45270c9b62c2207fc1d1b21349b18e7ebe49a525e1d8fba2ee3f2785b6365ff', `persistence_token` = '6ab0d392043a19916308d876eda76b57aaaba12d9dab0c579b44c184bd9a2130d03649872001cf05e341f83cf49d9da85266cfc23a052a62777c4f9be93b45d2', `updated_at` = '2012-07-06 23:20:05' WHERE `users`.`id` = 3
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy