app/controllers/users_controller.rb

  def index
    @currently_assigned = User.current_chore_user
    @users = User.order('chore_date DESC')
    if current_user
      @next_chore = Time.now.to_date + (User.where('chore_date < ?', current_user.chore_date).count + 1).days
---
SELECT `users`.* FROM `users` WHERE `users`.`chore_date` = '2012-08-08' LIMIT 1
SELECT COUNT(*) FROM `users` WHERE (chore_date < '2012-10-01')